#1.List(Список):
#a) Створіть пустий список і додайте до нього 3 різних числа. Виведіть список на екран.
#б) Змініть значення другого елемента в списку. Виведіть оновлений список.
#в) Видаліть третій елемент зі списку. Виведіть оновлений список.
#г) Створіть другий список, з кількома числами більшими за 10. Додайте в кінець першого списку. Виведіть
#на екран зріз списку від третього до п'ятого елементу.
#д) Поміняйте місцями найбільше та найменше число в списку.

a = []
a.extend([1, 2, 3])
print(a)

a[1] = 4
print(a)

a.pop()
print(a)

a = a + [10, 11, 12, 13, 14]
print(a)

a = a[3:5:1]
print(a)

a[0], a[1] = a[1], a[0]
print(a)

#2. Tuple(Кортеж):
#а) Створіть кортеж з трьох різних елементів. Виведіть кортеж на екран. Спробуйте змінити значення першого
#елемента кортежу. Спостереження: кортежі є незмінними, тому ця спроба має завершитися помилкою.
#б) Створіть другий кортеж та об’єднайте два кортежі в один. Виведіть оновлений кортеж.

tup = (7, 8, 10)
print(tup)

try:
    list(tup)[0] = 5
except TypeError:
    print('Успішно вивелося')
else:
    print('Поганий запит, не можливо змінити')
finally:
    print('Я подумаю про це пізніше')

tup2 = (11, 25, 3)
c = tup + tup2
print(c)

#3. Set(Множина):
#а) Створіть множину, яка містить 4 різних значення. Виведіть множину на екран.
#б) Додайте нове значення до множини. Виведіть оновлену множину.
#в) Видаліть одне значення з множини. Виведіть оновлену множину.

my_set = {2, 8, 10, 1}
print(my_set)

my_set.add(18)
print(my_set)

my_set.remove(1)
print(my_set)

#4. Frozenset(Незмінювана множина):
#а) Створіть frozenset, що містить 3 різних значення. Виведіть frozenset на екран.
#б) Спробуйте змінити(додати або видалити) значення в frozenset. Спостереження: frozenset
#є незмінним, тому будь - яка спроба зміни має завершитися помилкою.
#в) Створіть ще один frozenset з різними значеннями.Об’єднайте два frozenset в новий frozenset. Виведіть отриманий frozenset.

my_froze = frozenset([9, 5, 13])
print(my_froze)

try:
    list(my_froze)[0] = 5
except TypeError:
    print('Успішно вивелося')
else:
    print('Поганий запит, не можливо змінити')
finally:
    print('Я подумаю про це пізніше')

my_froze2 = frozenset([1, 7, 8])
union_froze = my_froze.union(my_froze2)
print(union_froze)

#5. String(Рядок):
#а) Створіть рядок, що містить #ваше ім’я з маленької літери. Виведіть рядок на екран.
#б) Змініть першу літеру вашого імені на велику літеру. Виведіть оновлений рядок.
#в) Підрахуйте кількість символів у вашому рядку. Виведіть результат.

my_string = 'yana'
print(my_string)

my_string = my_string.replace('y', 'Y')
print(my_string)

my_string1 = len(my_string)
print(my_string1)

#6. Dict(Словник):
#а) Створіть словник, що містить пари ключ - значення про ваші улюблені продукти (наприклад: ягода - - суниця).Виведіть
#словник на екран.
#б) Додайте нову пару ключ - значення до словника.Виведіть оновлений словник.
#в) Видаліть одну пару ключ - значення зі словника.Виведіть оновлений словник.

my_dict = {'фрукт':'апельсин', 'овоч': 'огірок', 'ягода': 'суниця'}
print(my_dict)

my_dict['горіхи'] = 'ліщина'
print(my_dict)

del my_dict['овоч']
print(my_dict)